// Выпадающее меню Эссе
const essayBtn = document.getElementById("essayBtn");
const essayMenu = document.getElementById("essayMenu");

essayBtn.addEventListener("click", () => {
    essayMenu.classList.toggle("open");
});

function loadPage(page) {
    const content = document.getElementById('contentWindow');
    content.innerHTML = ''

       if(page === 'game') {
        // вставляем canvas для змейки
        const canvas = document.createElement('canvas');
        canvas.id = 'gameCanvas';
        canvas.width = 400;
        canvas.height = 400;
        content.appendChild(canvas);

        // кнопка сброса
        const resetBtn = document.createElement('button');
        resetBtn.textContent = "Сбросить игру";
        resetBtn.className = "reset-button";
        resetBtn.onclick = () => startSnake(); // функция перезапуска игры
        content.appendChild(resetBtn);

        // подключение snake.js
        const script = document.createElement('script');
        script.src = 'snake.js';
        content.appendChild(script);
    }
if (essays[page]) {
        content.innerHTML = essays[page];
    } else if (page === 'main') {
        content.innerHTML = `<h3>Это сайт :></h3><p>Нажмите кнопки сбоку для навигации по сайту</p>`;
    }
    
}


function loadMap() {
    document.getElementById("contentWindow").innerHTML = `
        <h3>Карта</h3>

        <div class="map-container">
            <iframe 
                id="mapFrame"
                src="https://yandex.ru/map-widget/v1/?z=12&ll=37.620393%2C55.75396"
                frameborder="0">
            </iframe>
        </div>

        <div class="map-buttons">
            <button onclick="setMarker('university')">Университет</button>
            <button onclick="setMarker('home')">Дом</button>
        </div>
    `;
}

// Функция установки меток
function setMarker(type) {
    const map = document.getElementById("mapFrame");

    let coords = "";
    
   if (type === "university") {
    coords = "37.804125,47.994061"; // Донецк, Артёма 58
}

if (type === "home") {
    coords = "37.969676,48.097035"; // Макеевка, кв. Шахтёрский 10
}

    map.src = `https://yandex.ru/map-widget/v1/?z=16&pt=${coords}&ll=${coords}`;
}

const essays = {
    essay1: `<h2>МОЕ ПРЕДСТАВЛЕНИЕ О ПРОШЛОМ И БУДУЩЕМ КОМПЬЮТИНГА</h2>
<p>Компьютинг прошел долгий путь от примитивных вычислительных устройств до мощных и универсальных систем, которые мы используем сегодня. Его история начинается еще в XVII веке, когда люди начали создавать первые механические устройства для упрощения арифметических операций.</p>

<h3>Механические вычислительные устройства</h3>
<p>Компьютинг – это вычисление, выполняемое на компьютере, и деятельность, направленная на разработку и применение компьютерных технологий, включая аппаратное и программное обеспечение. Термин также обозначает обобщённую область знаний, охватывающую информатику, программную инженерию, проектирование аппаратных платформ и другие дисциплины, связанные с информационными технологиями. Компьютинг отличается от компьютерных наук тем, что последние изучают теоретические основы компьютинга и применения этих теорий.</p>

<h3>1.1 Будущее компьютинга</h3>
<p>Компьютинг – это широкий комплекс вычислений и деятельности, связанных с созданием, развитием и применением компьютерных технологий. Проще говоря, компьютинг – это процесс выполнения вычислений на компьютере, а также все, что связано с аппаратным обеспечением, программами и методами их использования.</p>

<p>Термин компьютинг обозначает обширную научную и инженерную дисциплину. Она включает:</p>
<ul>
<li>аппаратное обеспечение – проектирование и создание физических компьютерных компонентов: процессоров, памяти, устройств ввода/вывода;</li>
<li>программное обеспечение – разработку программ, операционных систем, прикладных решений;</li>
<li>информатику – теоретические основы обработки и передачи информации;</li>
<li>программную инженерию – методы системной разработки качественного и надежного программного обеспечения, начиная от анализа требований и заканчивая тестированием;</li>
<li>проектирование архитектуры вычислительных платформ;</li>
<li>другие дисциплины в области информационных технологий, такие как кибербезопасность, визуализация данных, базы данных, сетевые технологии.</li>
</ul>

<h3>1.2 Современное понимание компьютинга</h3>
<p>Сегодня компьютинг рассматривается как самостоятельная наука и область знаний, больше не ограниченная только алгоритмами и программированием. В нее входят новые направления:</p>
<ul>
<li>интернет и технологии Web;</li>
<li>мобильный компьютинг;</li>
<li>безопасность и охрана киберпространства;</li>
<li>проектирование пользовательских интерфейсов;</li>
<li>высокопроизводительные вычисления (например, суперкомпьютеры);</li>
<li>искусственный интеллект и машинное обучение;</li>
<li>визуализация информации и цифровые мультимедиа;</li>
</ul>

<p>Компьютинг занимается интеграцией этих областей для создания новых технологий и решения современных задач в науке, бизнесе, образовании и других сферах. Таким образом, компьютинг – это всеобъемлющая область знаний и практики, объединяющая аппаратные и программные решения с теорией обработки данных и методов их трансформации, существенно отличающаяся от более узко направленных компьютерных наук.</p>

<h3>1.3 Прошлое компьютинга</h3>
<p>В 1642 году французский математик Блез Паскаль изобрел одну из первых механических счетных машин – Pascaline. Она позволяла выполнять сложение и вычитание с помощью системы передач и шестерёнок. Позже, в конце XVII века, немецкий математик Готфрид Вильгельм Лейбниц разработал аналогичное устройство, способное еще и умножать и делить – механический калькулятор с зубчатыми колесами. Эти ранние машины были узкоспециализированными устройствами, предназначенными для автоматизации рутинных арифметических операций.</p>

<p>В XIX веке важную роль сыграл ткацкий станок Жозефа Мари Жаккарда, использовавший перфорированные карты для управления узорами ткачества, что можно считать прообразом программируемых машин. Также именно в XIX веке Чарльз Бэббидж задумал и попытался создать аналитическую машину – первый концепт универсального вычислительного устройства. Его разработка предвосхитила возможности современных компьютеров, хотя технические ограничения того времени не позволили реализовать эту идею полностью.</p>

<h3>Электромеханические и электронные компьютеры</h3>
<p>Переход от механических устройств к электронным начался в первой половине XX века. В 1937 году американский изобретатель Джон Атанасов вместе с Клиффордом Берри создали первый электронный цифровой компьютер, который мог хранить данные в памяти и выполнять операции автоматизированно. В это же время немецкий конструктор Конрад Цузе разработал машину Z3 – один из первых программируемых цифровых компьютеров.</p>

<p>После Второй мировой войны появились первые массовые электронные компьютеры на вакуумных лампах, такие как ENIAC, способные выполнять тысячи операций в секунду. Эти гигантские машины использовались для военных и научных расчетов и заложили фундамент для дальнейшего развития.</p>

<p>Появление транзисторов в 1947 году сделало компьютеры более надежными и компактными, а последующий переход к интегральным схемам в 1960-х радикально увеличил скорость и уменьшил размеры устройств. В 1971 году Intel представила первый микропроцессор – центральный элемент всех будущих персональных компьютеров.</p>

<h3>Появление персональных компьютеров и операционных систем</h3>
<p>Ключевым этапом стала эра персональных компьютеров в 1980-х годах. Компании Apple и IBM начали массово выпускать ПК, которые можно было использовать дома и в офисе, а появление графических операционных систем, таких как Microsoft Windows и Apple Macintosh, сделало компьютеры удобными и доступными для широкого круга пользователей.</p>

<p>Также в этот период активно развивались языки программирования – от ассемблера до высокоуровневых языков, что значительно упростило создание программ и взаимодействие человека с машиной. Программное обеспечение превратилось в независимую сферу, а сама вычислительная техника – в универсальную платформу для решения разнообразных задач – от обработки текста до графики и коммуникаций [3].</p>

<p>Прошлое компьютинга – это путь от простейших вычислительных устройств, автоматизирующих арифметику, до сложных электронных и программных систем. Оно включает переход от узких вычислительных задач к универсальным, интерактивным вычислительным платформам. Благодаря этому можно говорить о фундаменте, заложенном для развития искусственного интеллекта, интернета, виртуальной и дополненной реальности, без которых современная цифровая жизнь невозможна.</p>

<h3>1.4 Мое представление о будущем компьютинга</h3>
<p>С каждым годом вычислительная мощность компьютеров растет, они становятся более мощными и могут поддерживать больше функций. Будущее компьютеров обещает быть революционным, кардинально изменяя нашу жизнь и взаимодействие технологий. Еще не так давно для размещения одного компьютера требовалось целое трехэтажное здание, а сегодня аналогичная вычислительная мощность легко умещается в кармане.</p>

<p>В ближайшие десятилетие главным трендом станет развитие искусственного интеллекта и машинного обучения. Компьютеры могут не только быстро выполнять сложные вычисления, но и понимать, анализировать и принимать решения почти как человек. Это позволит создавать интеллектуальные помощники, способные прогнозировать наши потребности и подстраиваться под индивидуальные особенности.</p>

<p>Другим важным направлением станет квантовые вычисления. В отличие от классических компьютеров, квантовые используют принципы квантовой физики, что даст возможность решать задачи, невозможные сегодня – такие как моделирование молекулярных структур для медицины или анализа больших данных на совершенно новом уровне.</p>

<p>Я слышал, что компания Майкрософт создала новый вид материи, и это может навсегда изменить вычисление. Мы все знаем три привычных состояния вещества – твёрдое, жидкое и газообразное. Но после почти 20 лет исследований Майкрософт заявила, открыла нечто принципиально новое – топологическое состояние.</p>

<p>Они использовали специальные материалы, топокондукторы, и на их основе создали Majorana-1, первый в своём роде квантовый процессор. В квантовых компьютерах ключевую роль играют кубиты – своеобразные строительные блоки квантовых вычислений. Но традиционные кубиты ужасно нестабильны. К примеру, как карандаш, который стоит на кончике пальца. Именно поэтому создание массивных квантовых систем такая сложная задача. Но Майкрософт нашла способ решить эту проблему. Кубиты на основе топокондукторов получились быстрее, стабильнее и гораздо компактнее – всего одна сотая миллиметра. Благодаря этому на одном чипе можно уместить до одного миллиона кубитов. А чем больше кубитов, тем мощнее вычислительные возможности. Эти чипы смогут решать задачи, которыми не справляются даже все существующие суперкомпьютеры вместе взятые, плюс вся эта мощность будет умещаться на ладони. Точно так же, как полупроводники однажды сделали возможным появление современных компьютеров, топокондукторы могут открыть эру настоящих квантовых вычислений. Представьте создание принципиально новых материалов, понимание тёмной материи, квантовые нейросети и возможно даже взлом всей современной криптографии. Многие думали, что квантовые компьютеры – это вопрос далёких десятилетий, но Microsoft намекает, что этот момент может наступить гораздо быстрее.</p>

<p>Мне кажется, что настоящий технологический прорыв произойдет, когда удастся объединить две самые прогрессивные сегодня технологии: искусственный интеллект и дополненную реальность. Если объединить искусственный интеллект и очки виртуальной или дополненной реальности, это откроет совершенно новые горизонты взаимодействия человека с цифровым миром. ИИ будет обеспечивать интеллектуальное понимание и адаптацию контента в реальном времени, делая виртуальные образы и дополнения максимально персонализированными и полезными.</p>

<p>В таких очках ИИ сможет анализировать окружение, распознавать объекты, лица и эмоции, а затем показывать пользователю важную информацию или подсказки непосредственно в поле зрения. Это повысит эффективность работы, обучения и общения, ведь человек будет получать мгновенную поддержку и рекомендации без лишних действий. Виртуальная и дополненная реальность с ИИ превратятся в расширение нашей памяти и интеллекта, помогая ориентироваться в сложном мире и принимать более обоснованные решения.</p>

<p>В итоге, такое сочетание станет мостом между реальным и цифровым, где технологии будут не просто инструментом, а активным и умным помощником, улучшающим качество жизни и открывающим новые возможности для творчества, обучения и повседневных задач.</p>
`,
    essay2: `<h2>МОЙ ПУТЬ В ИНФОРМАЦИОННО-КОМПЬЮТЕРНЫЕ ТЕХНОЛОГИИ</h2>
    <p>Мой путь в информационно-компьютерные технологии начался в очень раннем детстве, когда мне было всего 6 лет и в нашей семье появился первый компьютер. Тогда я едва понимал, что такое операционная система и как множество компонентов взаимодействуют между собой, чтобы выполнять одни и те же задачи. Всё было новым и загадочным, но именно тогда зародился мой глубокий интерес к изучению этой сложной и удивительной системы. Я начал с самых базовых операций – освоения интерфейса, знакомства с простыми программами и играми, что постепенно пробуждало желание изучать компьютер глубже и лучше понимать его работу.</p>

<p>В школе моё обучение поддерживало и развивало этот интерес. Сначала я учился работать с офисным программным обеспечением – текстовыми редакторами, электронными таблицами и программами для создания презентаций. Это не только помогало выполнять учебные проекты, но и на первых порах формировало представление о том, какую огромную роль компьютерные технологии играют в современном обществе и бизнесе. Я осознавал, что программное обеспечение – это не только инструмент для работы, но и поле для творчества и самовыражения.</p>

<p>Как только появился опыт работы с офисным софтом, следующим шагом стало изучение программирования. Моя первая языковая стезя началась с изучения Паскаля. Этот язык стал для меня фундаментом, который дал возможность понять основы программирования – структуру, логику и последовательность действий. Мои первые самостоятельные проекты включали написание программ для решения уравнений – это был замечательный вызов, который позволил ощутить, каким образом посредством кода можно заставить компьютер обрабатывать сложные математические задачи с точностью и скоростью. С каждым новым написанным алгоритмом росла моя уверенность и навыки.</p>

<p>Далее я познакомился с веб-технологиями, начав с основ языка HTML. Создание простого сайта – интернет-магазина с описанием, изображениями и системой навигации – открыло для меня новый мир цифровых коммуникаций и разработок. Этот проект научил меня структурировать информацию и создал базу для будущего углубленного изучения веб-разработки. Уже тогда я начал понимать, что программирование – это широкий спектр знаний и умений, позволяющих создавать все более сложные и функциональные продукты.</p>

<p>В процессе обучения я неизбежно столкнулся с техническими трудностями. Например, установка программ, загруженных с непроверенных источников или «пиратских» сайтов, часто сопровождалась ошибками и сбоями, и это подтолкнуло меня к более глубокому изучению операционной системы. Пришлось разбираться, как работают системные процессы, как реагировать на разные ошибки и находить пути их решения. Такой практический опыт стал очень ценным, он позволил мне не бояться непредвиденных ситуаций и быстро находить выход из них.</p>

<p>Помимо технического развития, меня вдохновляет сама идея автоматизации. Возможность с помощью небольших скриптов и программ значительно облегчить рутинную работу, экономить время и ресурсы – это удивительно. Особенно впечатляют программисты-одиночки, которые самостоятельно разрабатывают полноценные игры и приложения, иногда становясь известными и добиваясь признания. Истории успешных разработчиков, которые начинали с нуля и шаг за шагом строили карьеру с помощью самообразования и настойчивости, мотивируют меня идти вперед и не останавливаться на достигнутом.</p>

<p>Поступив в Донецкий национальный технический университет на специальность «Компьютерная инженерия», я поставил перед собой амбициозную цель – получить всесторонние и глубокие знания как в области аппаратного обеспечения, так и программного обеспечения. Такая комплексность дает уникальную возможность понять не только как работают современные компьютеры изнутри, но и как создавать сложные технологические решения, интегрирующие программное обеспечение с аппаратными платформами.</p>

<p>В университете я осваиваю фундаментальные дисциплины – математику, теорию алгоритмов, архитектуру вычислительных систем, а также современные направления – разработку программных систем, сетевые технологии, базы данных и искусственный интеллект. Я считаю важным не просто изучать теорию, но и применять знания на практике: участвовать в лабораторных работах, разрабатывать проекты, проходить стажировки, которые дают реальный опыт работы с современными технологиями.</p>

<p>Моя конечная цель – работать в крупных и известных технологических компаниях, знаменитых своими инновациями и передовыми разработками. Я хочу сделать свой вклад в развитие IT-индустрии, создавать проекты, которые будут полезны и востребованы. Для этого я стараюсь постоянно совершенствовать свои навыки, быть в курсе последних трендов и новшеств, расширять знания и развивать профессиональные компетенции.</p>

<p>Таким образом, мой путь в информационно-компьютерные технологии – это непрерывное развитие и рост, преодоление трудностей и стремление к профессионализму. Он начинается с раннего увлечения и детского любопытства, переходит в практическое изучение и образование, и направлен на достижение высоких целей в будущем, чтобы стать частью технологического прогресса и создавать новые решения, меняющие мир.</p>
`,
    essay3: `<h2>ИДЕИ И ПРОЕКТЫ, КОТОРЫЕ ХОТИТЕ РЕАЛИЗОВАТЬ В БУДУЩЕМ</h2>

<p>Идеи и проекты, которые я хочу реализовать в будущем, связаны с двумя быстро развивающимися и взаимодополняющимися областями – виртуальной реальностью (VR) и искусственным интеллектом (ИИ). Эти технологии обладают огромным потенциалом для трансформации самых разных аспектов нашей жизни, от образования и развлечений до медицины и промышленности. В этом эссе я подробно расскажу о своих идеях и планах в этих сферах, а также о том, как я собираюсь реализовать их на практике.</p>

<h3>3.1 Проекты в области виртуальной реальности (VR)</h3>

<p>Виртуальная реальность – это технология, позволяющая пользователям погрузиться в искусственно созданную среду, имитирующую реальный или фантазийный мир. Мне особенно интересно использовать VR для создания образовательных и развлекательных приложений нового поколения.</p>

<p>Первая идея – создание образовательной VR-платформы, которая позволит студентам и школьникам изучать сложные предметы через интерактивные виртуальные лаборатории и симуляции. Например, в химии можно погружаться внутрь молекул, изучать их строение и реакции, видеть процесс наглядно и в реальном времени. Аналогично, в биологии, медицине или физике можно создавать виртуальные эксперименты, где ошибки не приведут к реальным последствиям, что сделает обучение более безопасным и увлекательным.</p>

<p>Вторая идея связана с развитием VR для терапии и реабилитации. Она включает разработку программ для помощи людям с психическими расстройствами, такими как тревожность, депрессия или посттравматический стресс. Виртуальная реальность позволяет моделировать ситуации и тренировать мозг в безопасном контролируемом окружении, что помогает пациентам лучше справляться с реальными трудностями. Также VR может использоваться для физической реабилитации – создание игровых задач, которые мотивируют пациентов выполнять необходимые упражнения.</p>

<p>Кроме того, я хочу разрабатывать проекты в области VR-развлечений, например, интерактивные истории и квесты, где пользователь не просто наблюдатель, а активный участник сюжета. Для этого важно изучать психологию взаимодействия с виртуальной средой и создавать интуитивные интерфейсы.</p>

<h3>3.2 Проекты и эксперименты в сфере искусственного интеллекта (ИИ)</h3>

<p>Искусственный интеллект – это одна из ключевых технологий современности, способная кардинально изменить экономику, социум и науку. Меня особенно привлекает перспектива создания интеллектуальных систем, которые помогают человеку принимать решения, разрабатывать новые идеи и улучшать качество жизни.</p>

<p>Одна из моих главных идей – разработка ИИ для помощи в творчестве и научных исследованиях. Такой ИИ мог бы анализировать огромные массивы данных, находить скрытые закономерности и предлагать новые гипотезы для проверки. Например, в биоинформатике или химии с его помощью можно ускорять поиск новых лекарств, моделировать сложные процессы и проводить эксперименты виртуально.</p>

<p>Мне также интересна реализация проектов по созданию ИИ-систем персонализированного обучения. Эти системы могут автоматически подстраиваться под уровень, интересы и темп обучения каждого человека, что сделает процесс более эффективным и мотивирующим. Важно, чтобы такие ИИ учитывали не только академические знания, но и эмоциональное состояние, помогали управлять стрессом и формировали навыки саморегуляции.</p>

<p>Вдобавок я хочу попробовать себя в разработке ИИ для компьютерного зрения и анализа видео. Это направление открывает возможности в области безопасности, медицины (например, диагностика по снимкам), а также в интерактивных играх и VR – для более естественного взаимодействия с пользователем.</p>

<h3>3.3 Как я планирую реализовать эти идеи</h3>

<p>Для успешной реализации проектов в VR и ИИ необходимы глубокие знания в программировании, математике, работе с данными и понимание психологии пользователя. Поэтому я собираюсь:</p>

<ul>
  <li>продолжать активное обучение через профильные курсы и онлайн-обучение;</li>
  <li>участвовать в хакатонах и конкурсах, чтобы практиковать создание прототипов;</li>
  <li>работать над небольшими проектами, последовательно проверяя и развивая свои идеи;</li>
  <li>изучать современные научные публикации и применять лучшие практики из индустрии;</li>
  <li>стремиться к сотрудничеству с экспертами и менторству для ускорения профессионального роста.</li>
</ul>
`
};